#ДЗ-2 Уварова Романа 2035-ПБ-2/3-213

#Задание №5
num = int(input("Введите число: "))
print(num<=20 and num>=10)

#Задание №6
num1 = float(input("Введите число: "))
print(num1<1 and num1>0)

#Задание №7
num2 = str(input("Введите число: "))
print(len (num2)==4)