#ДЗ-6 Уварова Романа 2035-ПБ-2/3-213
#Задача №8
a=[1, 5, 3, 8, 4, 8, 1, 8, 2, 9, 3, 5, 3]
for i in a:
    if a.count(i)>1:
        a.remove(i)
print(a)

#Задача №9
b=[6, 4, 2, 8, 5, 3, 4, 8, 1, 9, 2, 7, 1]
b.sort()
print(b)

#Задача №10
n1=['Илья']
n2=['Эдуардович']
n=n1+n2
print(n)