#ДЗ-5 Уварова Романа 2035-ПБ-2/3-213

#Задание №1
a=str(input())
print(a[::-1])

#Задание №2
b=str(input())
print(b.count("a")+b.count("e")+b.count("i")+b.count("o")+b.count("u"))

#Задание №3
c=str(input())
print(c==c[::-1])

#Задание №4
d=str(input())
print(d.count(" ")+1)