#ДЗ-7 Уварова Романа 2035-ПБ-2/3-213.py

#Задание №10
s={"Я":"I", "учу":"learn", "питон":"python"}
print(s)
while 1==1:
    s.pop(input("Введите элемент, который хотите удалить: "))
    print(s)

#Задание №11
f={0:'питон', -341:'Этот', 1037:'имба!', 26:'просто'}
g=sorted(dict.keys(f))
print(f[g[0]], f[g[1]], f[g[2]], f[g[3]])

#Доп.задача №1
n1=set(input())
n2=set(input())
m=list(n1)+list(n2)
n=set()
for i in m:
    if m.count(i)==1:
        n.add(i)
print(n)

#Доп.задача №2
o1=(input("Введите оценки по биологии первого ученика: ")).split()
o2=(input("Введите оценки по биологии второго ученика: ")).split()
o3=(input("Введите оценки по биологии третьего ученика: ")).split()
o=set(o1+o2+o3)
j={'0', '1', '2', '3', '4', '5', '6', '7', '8', '9'}
print(j^o)